---
kind: type
id: T:Autodesk.Revit.DB.MarginType
source: html/4a29699a-d8b0-c54b-6fb6-c831d3569435.htm
---
# Autodesk.Revit.DB.MarginType

An enumerated type listing all Margin types of Print Setting.

## Syntax (C#)
```csharp
public enum MarginType
```